app/Controllers/PenggembalianController.php

    public function tampilanPengembalian()
    {
        $pengembalianList = $this->viewPengembalianModel->findAll();
---
SELECT *
FROM `view_pengembalian`

        ];

        // Cek jika penyimpanan data gagal
        if (!$this->pengembalianModel->save($data)) {
---
INSERT INTO `pengembalian` (`id_anggota`, `id_buku`, `id_pengunjung`, `id_peminjam`, `jumlah_kembali`) VALUES ('15002', 'BP002', '12', '9', '2')