app/Models/PengembalianModel.php

    public function getBuku($id_buku)
    {
        // Periksa apakah buku ada di tabel peminjaman dengan jumlah lebih dari 0
        return $this->db->table('peminjaman')
            ->where('id_buku', $id_buku)
            ->where('jumlah >', 0) // Buku dipinjam jika jumlah > 0
            ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `id_buku` = 'BP002'
AND `jumlah` > 0

    public function getJumlah($id_peminjam)
    {
        $peminjaman = $this->db->table('peminjaman')
            ->select('jumlah')
            ->where('id_peminjam', $id_peminjam)
            ->get()
            ->getRow();
---
SELECT `jumlah`
FROM `peminjaman`
WHERE `id_peminjam` = '9'

    public function getPengunjungPerHari($tanggal)
    {
        return $this->db->table('pengunjung')
            ->where('DATE(waktu_kunjungan)', $tanggal) // Filter berdasarkan tanggal
            ->select('id_anggota, id_pengunjung')
            ->get()
            ->getResult();
---
SELECT `id_anggota`, `id_pengunjung`
FROM `pengunjung`
WHERE DATE(waktu_kunjungan) = '2025-01-12'

    public function getPeminjam()
    {
        // Ambil semua peminjam dengan jumlah pinjam lebih dari 0
        return $this->db->table('peminjaman')
            ->select('id_anggota, id_peminjam')
            ->where('jumlah >', 0) // Pastikan jumlah pinjaman lebih dari 0
            ->get()
            ->getResult();
---
SELECT `id_anggota`, `id_peminjam`
FROM `peminjaman`
WHERE `jumlah` > 0

    public function getAnggota($id_anggota)
    {
        // Ambil semua id anggota dengan jumlah pinjam lebih dari 0
        return $this->db->table('peminjaman')
            ->select('id_anggota', $id_anggota)
            ->where('jumlah >', 0) // Pastikan jumlah pinjaman lebih dari 0
            ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `jumlah` > 0