app/Models/ViewPengunjungModel.php

    public function getPengunjungHariIni()
    {
        $hariIni = date('Y-m-d');
        return $this->where('DATE(waktu_kunjungan)', $hariIni)->findAll();
---
SELECT *
FROM `view_pengunjung`
WHERE DATE(waktu_kunjungan) = '2025-01-12'